<template>
  <page>
    <ve-line :data="chartData"></ve-line>
  </page>
</template>

<script>
export default {
  data: function () {
    return {
      chartData: {
        columns: ["日期", "访问用户", "下单用户", "下单率"],
        rows: [
          { 日期: "14:10", 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
          { 日期: "14:20", 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
          { 日期: "14:30", 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
          { 日期: "14:40", 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
          { 日期: "14:50", 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
          { 日期: "15:00", 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 },
        ],
      },
    };
  },
};
</script>